#+TITLE:  brew 配置
#+AUTHOR: 孙建康（rising.lambda）
#+EMAIL:  rising.lambda@gmail.com

#+DESCRIPTION: brew 配置文件
#+PROPERTY:    header-args        :comments org
#+PROPERTY:    header-args        :mkdirp yes
#+OPTIONS:     num:nil toc:nil todo:nil tasks:nil tags:nil
#+OPTIONS:     skip:nil author:nil email:nil creator:nil timestamp:nil
#+INFOJS_OPT:  view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js

*** 使用清华大学 git 镜像加速
    #+BEGIN_SRC shell :tangle no :exports code :results none
      # brew 程序本身，Homebrew/Linuxbrew 相同
      git -C "$(brew --repo)" remote set-url origin https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/brew.git
      # 以下针对 mac OS 系统上的 Homebrew
      git -C "$(brew --repo homebrew/core)" remote set-url origin https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git
      git -C "$(brew --repo homebrew/cask)" remote set-url origin https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git
      git -C "$(brew --repo homebrew/cask-fonts)" remote set-url origin https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git
      git -C "$(brew --repo homebrew/cask-drivers)" remote set-url origin https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git
    #+END_SRC

*** Brew 配置
    #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
      cask_args appdir: '/Applications'
      tap 'homebrew/cask' if OS.mac?
      tap 'homebrew/bundle'
    #+END_SRC

    
*** 命令行工具
**** gnu 工具
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'inetutils' if OS.mac?
       brew 'coreutils' if OS.mac?
       brew 'binutils' if OS.mac?
       brew 'moreutils' if OS.mac?
       brew 'findutils' if OS.mac?
     #+END_SRC
    
**** 增强工具
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'hub' # github command line
       brew 'tldr'
       brew 'tree'
       brew 'bat'
       brew 'eth-p/software/bat-extras'
       brew 'watch'
     #+END_SRC

**** shell 工具
***** 并行
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'parallel', greedy: true, link: true
      #+END_SRC

*** 开发相关
**** 语言相关
***** c++
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'bear'
        brew 'make'
        brew 'cmake'
        brew 'ninja'
        brew 'gcc'
        brew 'llvm'
        brew 'boost'
      #+END_SRC
****** macos x11 开发
       #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
         cask 'xquartz'
       #+END_SRC

***** php
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'php'
      #+END_SRC
***** python
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'python'
      #+END_SRC
***** ruby
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'ruby'
      #+END_SRC  
***** ic
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'icarus-verilog'
        cask 'gtkwave', greedy: true
      #+END_SRC
***** pcb
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        cask 'kicad', greedy: true, args: {force:true}
      #+END_SRC 
***** OCaml
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'opam'
      #+END_SRC
***** javascript
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'node'
      #+END_SRC
***** markdown/orgmode
****** markdown/orgmode/xxx 格式转换工具
       #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
         brew 'pandoc'
       #+END_SRC
       pandoc 支持将 markdown, org, html 等等转换到 pdf, docx 等等格式

**** 编辑器
***** IDE
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        cask 'clion', greedy: true
        cask 'sublime-text', greedy: true
      #+END_SRC
***** Emacs
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        tap 'd12frosted/emacs-plus'
        brew 'emacs-plus@29', args: ["with-imagemagick", "with-native-comp"]
        cask "mactex-no-gui", greedy: true
        brew 'isync'
        brew 'notmuch'
        brew 'msmtp'
        brew 'texinfo'
        brew 'w3m'
        brew 'graphviz'
      #+END_SRC
***** vim
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'vim'
      #+END_SRC
      
**** 版本管理
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'tig'
       brew 'git'
       brew 'git-delta'
     #+END_SRC

**** 结构化查询
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'pup'
       brew 'jq'
       brew 'yq'
     #+END_SRC

**** 环境管理
***** 自动设置project 环境变量
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'direnv'
      #+END_SRC

**** 搜索
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'rg'
       brew 'fzf'
       brew 'autojump'
     #+END_SRC

**** 开发终端
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'zsh'
       brew 'reattach-to-user-namespace' if OS.mac?
       brew 'zsh-completions'
       brew 'tmux'
       brew 'urlview'
       brew 'tmuxinator'
     #+END_SRC

**** 代码分析
***** 行数统计
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'cloc'
      #+END_SRC
     
*** mac app store
    #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
      brew "mas" if OS.mac?
      # App Store
      mas "Reeder3", id: 880001334
      mas "ReadKit", id: 588726889
      mas "Hidden Bar", id: 1452453066
      mas "SwordSoft Screenink Free", id: 953841977
    #+END_SRC

*** 截图录像
**** obs stduio (录屏)
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'obs', greedy: true
     #+END_SRC
**** snipaste 截图
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'snipaste', greedy: true
     #+END_SRC
**** 音频捕捉分发
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'blackhole-16ch', greedy:true if OS.mac? 
     #+END_SRC
     配置步骤

     1. Open ~Audio Midi Setup~
     2. create ~Mulit-Output Device~
     3. Enable ~Built-in Output~ and ~BlackHole~ (一定要保证 Builtin device 在最上面，不然会有问题，另外除了声音源，不设置漂移，其他均启用)
     4. 设置 ~Multi-Output Device~ 为声音输出
**** 图片处理
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'tlk/imagemagick-x11/imagemagick'
     #+END_SRC
*** 音视频
**** 视频压缩/转码
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'handbrake', greedy: true  # 视屏压缩
       brew 'ffmpeg'
     #+END_SRC
     
**** 音乐播放
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'neteasemusic', greedy: true
       cask 'qqmusic', greedy: true
     #+END_SRC
**** 格式转换
***** flac to alac
      #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'xld'
      #+END_SRC
***** 元信息编辑
      #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
        brew 'exiftool' # exchange image format
      #+END_SRC

**** 视频播放
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'vlc', greedy: true
     #+END_SRC
*** 网络相关
**** 动态 hosts 文件
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'switchhosts', greedy: true
     #+END_SRC
**** 网络工具
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'nmap', greedy: true
     #+END_SRC
**** 下载工具
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'axel', greedy: true # multiple thread downloader
     #+END_SRC
**** 网络带宽测试
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'iperf', greedy: true
     #+END_SRC 
**** P2P 下载
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'thunder', greedy: true
     #+END_SRC
**** 浏览器
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'google-chrome', greedy: true
       cask 'firefox', greedy: true
     #+END_SRC
*** 系统安全
**** 防火墙
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'lulu', greedy: true
     #+END_SRC
*** 系统增强
**** 键盘布局更改
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'ukelele', greedy: true
     #+END_SRC
**** 连续按键问题增强
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'unshaky', greedy: true # process the mac keyboard duplicate key problem
     #+END_SRC
**** 键盘映射
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'karabiner-elements', greedy: true
     #+END_SRC
**** 系统控制
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'hammerspoon', greedy: true
     #+END_SRC
**** 终端
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'iterm2', greedy: true
     #+END_SRC
**** jvm
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'openjdk'
     #+END_SRC
**** 输入法
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link      
       cask 'squirrel', greedy: true
     #+END_SRC
*** 办公
**** 阅读
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'kindle', greedy: true
     #+END_SRC
**** 字典
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'youdaodict', greedy: true
     #+END_SRC
*** 聊天工具
    #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
      cask 'qq', greedy: true
      cask 'wechat', greedy: true
    #+END_SRC

*** 虚拟化
    #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
      cask 'docker', greedy: true
    #+END_SRC

*** 效率工具
**** 搜索/工作流（Alfred）
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'alfred', greedy: true
     #+END_SRC
**** 快捷键提示
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'cheatsheet', greedy: true
     #+END_SRC
**** 密码管理
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask '1password', greedy: true
     #+END_SRC
     
*** 系统清理
**** 软件卸载
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'appcleaner', greedy: true
     #+END_SRC

*** 压缩/解压
**** unarchiver (支持 windows 转码)
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'the-unarchiver', greedy: true
     #+END_SRC
**** rar 解压
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'unar'
     #+END_SRC
**** 并发 gzip 压缩解压
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       brew 'pigz'
     #+END_SRC
*** 加密解密
**** 虚拟盘
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'veracrypt', greedy: true
     #+END_SRC

*** 协作相关
    #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
      brew 'tiger-vnc'
    #+END_SRC

*** 画图
**** 流程图/架构/框架
     #+BEGIN_SRC conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'drawio', greedy: true
     #+END_SRC
*** 存储
**** 文件云存储
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'baidunetdisk', greedy: true
       cask 'nutstore', greedy: true
     #+END_SRC
**** 笔记云存储
     #+BEGIN_SRC  conf :tangle (m/resolve "${m/xdg.conf.d}/homebrew-bundle/Brewfile") :exports code :results none :eval never :comments link
       cask 'yinxiangbiji', greedy: true
     #+END_SRC

     
    
    
     #+BEGIN_SRC shell :eval (or (and (eq m/os 'macos) "yes") "never") :shebang #!/bin/bash :exports none :tangle no :results output silent :noweb yes :prologue "exec 2>&1" :epilogue ":" :comments link
       #brew bundle --global
     #+END_SRC
